# 작업 영역 오프셋 지정
# 게임 영역의 좌상단(0, 0)이 화면의 어느 구역에 있는지?
globalLocationOffset = (0, 50)

# 타이틀 - 게임 시작 버튼
gameStart = (133, 332)

# 슈의 의상 지정
sueDressUp = [
    (357, 237), # 머리
    (446, 252), # 상의
    (400, 287), # 드레스
    (365, 342), # 하의
    (429, 359) # 신발
]

# 의상 지정 버튼 - 겜시작
gameReallyStart = (174, 420)

# 게임 영역
# 시럽, 스틱 위치
syrupChoco = (368, 150)
syrupBerry = (409, 150)
cookieStick = (290, 170)

# 왼쪽 초코 제작 영역
workspaceL = [
    (112, 245),
    (68, 263),
    (142, 263),
    (103, 284),
    (62, 304),
    (134, 305),
    (94, 327),
    (47, 344),
    (131, 347),
    (88, 366)
]

# 왼쪽 냉동버튼
freezeButtonL = (137, 406)

# 오른쪽 초코 제작 영역
workspaceR = [
    (246, 244),
    (205, 267),
    (282, 261),
    (244, 284),
    (204, 307),
    (289, 305),
    (241, 323),
    (194, 346),
    (292, 348),
    (241, 364)
]

# 오른쪽 냉동버튼
freezeButtonR = (292, 410)

# 접시
tableLocation = (387, 331)
